In [7]:
import pandas as pd

In [114]:
df=pd.read_csv("Salary_Data.csv")

In [73]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [11]:
df['Gender']==  'Male'

0        True
1       False
2        True
3       False
4        True
        ...
6699    False
6700     True
6701    False
6702     True
6703    False
Name: Gender, Length: 6704, dtype: bool

In [12]:
gender_filter=df['Gender']== 'Male' #Mask

In [13]:
df[gender_filter]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6696,28.0,Male,PhD,Sales Representative,4.0,55000.0
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [14]:
df[df['Gender']== 'Male']

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6696,28.0,Male,PhD,Sales Representative,4.0,55000.0
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [16]:
df[df['Job Title'] == 'Software Engineer']

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
376,28.0,Female,Bachelor's,Software Engineer,3.0,125000.0
380,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
384,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
388,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
...,...,...,...,...,...,...
6191,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6205,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6219,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6233,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6247,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0

In [18]:
df[ (df['Job Title'] == 'Software Engineer') & (df['Gender'] =='Female')]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
376,28.0,Female,Bachelor's,Software Engineer,3.0,125000.0
380,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
384,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
388,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
392,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
...,...,...,...,...,...,...
3380,30.0,Female,Bachelor's Degree,Software Engineer,5.0,90000.0
4396,31.0,Female,Bachelor's Degree,Software Engineer,5.0,74000.0
5885,32.0,Female,Master's Degree,Software Engineer,9.0,120000.0
6012,33.0,Female,Master's Degree,Software Engineer,8.0,120000.0
6133,26.0,Female,Master's Degree,Software Engineer,2.0,75000.0

In [19]:
df['Job Title']

0           Software Engineer
1                Data Analyst
2              Senior Manager
3             Sales Associate
4                    Director
                ...
6699    Director of Marketing
6700          Sales Associate
6701        Financial Manager
6702        Marketing Manager
6703          Sales Executive
Name: Job Title, Length: 6704, dtype: object

In [22]:
df[(df['Job Title'] == 'Software Engineer') |(df['Education Level'] == "Master's Degree") ]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
376,28.0,Female,Bachelor's,Software Engineer,3.0,125000.0
380,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
384,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
388,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
...,...,...,...,...,...,...
6683,51.0,Female,Master's Degree,Content Marketing Manager,19.0,190000.0
6688,46.0,Male,Master's Degree,Director of Marketing,16.0,160000.0
6693,43.0,Female,Master's Degree,Sales Manager,14.0,140000.0
6697,51.0,Female,Master's Degree,Senior Product Marketing Manager,19.0,190000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [24]:
df[~(df['Job Title'] == 'Software Engineer')] # not

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [28]:
df[df['Job Title'].isin(['Data Analyst','Director','Financial Manager'])]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
4,52.0,Male,Master's,Director,20.0,200000.0
24,41.0,Male,Master's,Financial Manager,13.0,140000.0
81,41.0,Female,Master's,Data Analyst,13.0,80000.0
378,27.0,Female,Bachelor's,Data Analyst,2.0,110000.0
...,...,...,...,...,...,...
6645,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6662,42.0,Male,Bachelor's Degree,Financial Manager,13.0,130000.0
6673,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6690,42.0,Male,Bachelor's Degree,Financial Manager,13.0,130000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0

In [29]:
df.at[0,'Job Title']= None

In [30]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [31]:
df.at[1,'Job Title'] = pd.NA

In [32]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,<NA>,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [35]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,<NA>,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [36]:
df[df['Job Title'].str.contains('Manager',na=False)]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
11,48.0,Female,Bachelor's,HR Manager,18.0,140000.0
13,40.0,Female,Master's,Project Manager,14.0,130000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6695,33.0,Female,Bachelor's Degree,Content Marketing Manager,7.0,90000.0
6697,51.0,Female,Master's Degree,Senior Product Marketing Manager,19.0,190000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [37]:
df[df['Job Title'].str.contains('Manager',na=True)]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,<NA>,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6695,33.0,Female,Bachelor's Degree,Content Marketing Manager,7.0,90000.0
6697,51.0,Female,Master's Degree,Senior Product Marketing Manager,19.0,190000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [39]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [41]:
df[df['Age'] >=30]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
...,...,...,...,...,...,...
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [42]:
df[ (df['Age'] >=30) & (df['Age'] <=40) ]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0
12,35.0,Male,Bachelor's,Financial Analyst,6.0,65000.0
...,...,...,...,...,...,...
6691,36.0,Female,PhD,Marketing Manager,9.0,95000.0
6695,33.0,Female,Bachelor's Degree,Content Marketing Manager,7.0,90000.0
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0

In [45]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [46]:
df.sort_values('Age')

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
4988,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
5122,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
5109,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
5096,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4884,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
...,...,...,...,...,...,...
1225,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1304,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
1305,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
df.sort_values('Age',ascending=False) #artarak değil azalarak getir demek

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1305,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1304,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
1258,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1225,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1236,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
...,...,...,...,...,...,...
5044,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4897,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4962,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN

In [48]:
df.sort_values('Age',ascending=False,na_position='first')# boş satırları en başa koy demek

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN
1305,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1304,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
1258,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
...,...,...,...,...,...,...
5096,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
5083,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
5044,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4897,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4962,21.0,Female,High School,Junior Sales Representative,0.0,25000.0

In [49]:
df.sort_values('Age',ascending=False,inplace=True) #dataframein güncel halini böyle yaptım

In [50]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1305,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1304,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
1258,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1225,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1236,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
...,...,...,...,...,...,...
5044,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4897,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4962,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN

In [54]:
df.sort_values(['Age','Years of Experience'],ascending=[False,False])
# hem yaşı hem de çalışma yılını azalana göre sıralamasını istedik

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1236,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
1304,62.0,Male,PhD,Software Engineer Manager,20.0,200000.0
1225,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1258,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1305,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
...,...,...,...,...,...,...
5096,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
5109,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
5122,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN

In [55]:
df.sort_values(['Age','Years of Experience'],ascending=[True,False] )
#yaş artarak sıralansın çalışma yılı da azalarak sıralansın

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
4884,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4897,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4910,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4923,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
4936,21.0,Female,High School,Junior Sales Representative,0.0,25000.0
...,...,...,...,...,...,...
1225,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1258,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
1305,62.0,Male,PhD,Software Engineer Manager,19.0,200000.0
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN

In [56]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [58]:
df.sort_index()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [59]:
df.sort_index(ascending=False)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
6703,26.0,Female,High School,Sales Executive,1.0,35000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
...,...,...,...,...,...,...
4,52.0,Male,Master's,Director,20.0,200000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0

In [61]:
df.nlargest(10,'Salary')
#maaşı en yüksek 10 satır

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
30,50.0,Male,Bachelor's,CEO,25.0,250000.0
83,52.0,Male,PhD,Chief Technology Officer,24.0,250000.0
5001,45.0,Male,Bachelor's Degree,Financial Manager,21.0,250000.0
4276,51.0,Male,PhD,Data Scientist,24.0,240000.0
4291,51.0,Male,PhD,Data Scientist,24.0,240000.0
4306,51.0,Male,PhD,Data Scientist,24.0,240000.0
4321,51.0,Male,PhD,Data Scientist,24.0,240000.0
4336,51.0,Male,PhD,Data Scientist,24.0,240000.0
4351,51.0,Male,PhD,Data Scientist,24.0,240000.0
4366,51.0,Male,PhD,Data Scientist,24.0,240000.0

In [65]:
df.nsmallest(10,'Salary')
#maaşı en düşük 10 satır

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
259,29.0,Male,Bachelor's,Junior Business Operations Analyst,1.5,350.0
4633,31.0,Female,Bachelor's Degree,Junior HR Coordinator,4.0,500.0
1890,25.0,Female,Bachelor's Degree,Front end Developer,1.0,550.0
2654,23.0,Male,PhD,Software Engineer Manager,1.0,579.0
3893,22.0,Male,High School,Junior Sales Associate,1.0,25000.0
3906,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3921,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3936,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3951,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3966,29.0,Female,High School,Junior Sales Associate,1.0,25000.0

In [66]:
df=df.nsmallest(10,'Salary')

In [67]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
259,29.0,Male,Bachelor's,Junior Business Operations Analyst,1.5,350.0
4633,31.0,Female,Bachelor's Degree,Junior HR Coordinator,4.0,500.0
1890,25.0,Female,Bachelor's Degree,Front end Developer,1.0,550.0
2654,23.0,Male,PhD,Software Engineer Manager,1.0,579.0
3893,22.0,Male,High School,Junior Sales Associate,1.0,25000.0
3906,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3921,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3936,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3951,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
3966,29.0,Female,High School,Junior Sales Associate,1.0,25000.0

In [68]:
df.reset_index()

,index,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,259,29.0,Male,Bachelor's,Junior Business Operations Analyst,1.5,350.0
1,4633,31.0,Female,Bachelor's Degree,Junior HR Coordinator,4.0,500.0
2,1890,25.0,Female,Bachelor's Degree,Front end Developer,1.0,550.0
3,2654,23.0,Male,PhD,Software Engineer Manager,1.0,579.0
4,3893,22.0,Male,High School,Junior Sales Associate,1.0,25000.0
5,3906,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
6,3921,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
7,3936,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
8,3951,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
9,3966,29.0,Female,High School,Junior Sales Associate,1.0,25000.0

In [70]:
df.reset_index(drop=True)
#indexler gözükmesin istediğim için ekledim

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,29.0,Male,Bachelor's,Junior Business Operations Analyst,1.5,350.0
1,31.0,Female,Bachelor's Degree,Junior HR Coordinator,4.0,500.0
2,25.0,Female,Bachelor's Degree,Front end Developer,1.0,550.0
3,23.0,Male,PhD,Software Engineer Manager,1.0,579.0
4,22.0,Male,High School,Junior Sales Associate,1.0,25000.0
5,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
6,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
7,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
8,29.0,Female,High School,Junior Sales Associate,1.0,25000.0
9,29.0,Female,High School,Junior Sales Associate,1.0,25000.0

In [74]:
df.head(20)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0
10,29.0,Male,Master's,Software Developer,3.0,75000.0
11,48.0,Female,Bachelor's,HR Manager,18.0,140000.0
12,35.0,Male,Bachelor's,Financial Analyst,6.0,65000.0
13,40.0,Female,Master's,Project Manager,14.0,130000.0
14,27.0,Male,Bachelor's,Customer Service Rep,2.0,40000.0
15,44.0,Male,Bachelor's,Operations Manager,16.0,125000.0
16,33.0,Female,Master's,Marketing Manager,7.0,90000.0
17,39.0,Male,PhD,Senior Engineer,12.0,115000.0
18,25.0,Female,Bachelor's,Data Entry Clerk,0.0,35000.0
19,51.0,Male,Bachelor's,Sales Director,22.0,180000.0

In [75]:
df.describe()

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

In [78]:
df['Age'].median() #ortanca yaşı veriyo

np.float64(32.0)

In [79]:
df['Age'].mean() #yaş ortalamasını veriyo

np.float64(33.62085944494181)

In [80]:
df['Age'].min()

np.float64(21.0)

In [83]:
df['Age'].max()

np.float64(62.0)

In [85]:
df['Age'].std() #yaşların standart sapması

np.float64(7.614632626251303)

In [84]:
df.head(5)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [87]:
df['Gender'].value_counts() # gender kolonunda olan şeylerin kaç tane olduğuu verir

Gender
Male      3674
Female    3014
Other       14
Name: count, dtype: int64

In [89]:
df['Gender'].value_counts() ['Male'] # gender kolonunda kaç tane male olduğunu verir

np.int64(3674)

In [91]:
df['Education Level'].value_counts(normalize=True) 
# çalışanların mezun olduğu yerlerin 0-1 arasına göre değerini veriyo,örneğin üniversite
# mezunu olanların sayısı yüzle çarparsak %33 olur

Education Level
Bachelor's Degree    0.338308
Master's Degree      0.234741
PhD                  0.204149
Bachelor's           0.112819
High School          0.066856
Master's             0.042979
phD                  0.000149
Name: proportion, dtype: float64

In [94]:
df['Salary'].sum() #salaryde olan bütün sayıları toplar

np.float64(772575337.0)

In [95]:
df.groupby('Job Title')['Salary'].mean()
# tüm meslekleri kendi gurplarına ayırıp hepsinin tek tek maaş ortalamasını hesapladı

Job Title
Account Manager              75000.000000
Accountant                   55000.000000
Administrative Assistant     50000.000000
Back end Developer          102352.561475
Business Analyst             77500.000000
                                ...
UX Designer                  80000.000000
UX Researcher                65000.000000
VP of Finance               200000.000000
VP of Operations            190000.000000
Web Developer                66436.781609
Name: Salary, Length: 193, dtype: float64

In [117]:
df['Age']=df['Age'] +10 #tüm yaşlara 10 ekledik

In [120]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,42.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,38.0,Female,Master's,Data Analyst,3.0,65000.0
2,55.0,Male,PhD,Senior Manager,15.0,150000.0
3,46.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,62.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,59.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,42.0,Male,High School,Sales Associate,3.0,50000.0
6701,40.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,56.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,36.0,Female,High School,Sales Executive,1.0,35000.0

In [122]:
df['Years of Experience']=df['Years of Experience'].apply(lambda x: x+10)
# tecrübeli yıl sayılarını 10 arttırdı bunu apply ile yaptık

In [130]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,42.0,Male,Bachelor's,Software Engineer,15.0,90000.0
1,38.0,Female,Master's,Data Analyst,13.0,65000.0
2,55.0,Male,PhD,Senior Manager,45.0,150000.0
3,46.0,Female,Bachelor's,Sales Associate,37.0,60000.0
4,62.0,Male,Master's,Director,50.0,200000.0
...,...,...,...,...,...,...
6699,59.0,Female,PhD,Director of Marketing,50.0,200000.0
6700,42.0,Male,High School,Sales Associate,13.0,50000.0
6701,40.0,Female,Bachelor's Degree,Financial Manager,14.0,55000.0
6702,56.0,Male,Master's Degree,Marketing Manager,44.0,140000.0
6703,36.0,Female,High School,Sales Executive,11.0,35000.0

In [131]:
df['Years of Experience']=df['Years of Experience'].apply(lambda x: x+10 if x>15 else x)
# yine tecrübeli yıl sayısını 10 arttıracak ama tecrübe yılı 15 yıldan büyük olduğunda
# yapacak. Apply in avanatajı bu şart ekleyebiliyoruz

In [132]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,42.0,Male,Bachelor's,Software Engineer,15.0,90000.0
1,38.0,Female,Master's,Data Analyst,13.0,65000.0
2,55.0,Male,PhD,Senior Manager,55.0,150000.0
3,46.0,Female,Bachelor's,Sales Associate,47.0,60000.0
4,62.0,Male,Master's,Director,60.0,200000.0
...,...,...,...,...,...,...
6699,59.0,Female,PhD,Director of Marketing,60.0,200000.0
6700,42.0,Male,High School,Sales Associate,13.0,50000.0
6701,40.0,Female,Bachelor's Degree,Financial Manager,14.0,55000.0
6702,56.0,Male,Master's Degree,Marketing Manager,54.0,140000.0
6703,36.0,Female,High School,Sales Executive,11.0,35000.0